class BotText:
    start = ("⚡ Привет, {name}!\n\n"
             "📎 Как добавить канал:\n\n"
             "<b>1. Откройте профиль бота</b> — нажмите на название бота сверху\n"
             "<b>2. Нажмите кнопку «Добавить в группу или канал»</b>\n"
             "<b>3. Выберите нужный канал из списка или через поиск</b>\n"
             "<b>4. Добавьте бота с правом на «Управление сообщениями»</b>n"
             "<b>5. Нажмите «Готово» под этим сообщением</b>")

    ready_step = ("✅ <b>Отлично!</b>\n\n"
                  "💫 Теперь нажмите кнопку <b>«Выбрать канал»</b> и выберите добавленный канал")

    bot_kicked = ("❌ <b>Бота нет в этом канале!</b>\n\n"
                  "📎 Как добавить канал:\n\n"
                  "<b>1. Откройте профиль бота</b> — нажмите на название бота сверху\n"
                  "<b>2. Нажмите кнопку «Добавить в группу или канал»</b>\n"
                  "<b>3. Выберите нужный канал из списка или через поиск</b>\n"
                  "<b>4. Добавьте бота с правом на «Управление сообщениями»</b>n"
                  "<b>5. Нажмите «Готово» под этим сообщением</b>")

    added_channel = ("🎉 <b>Канал успешно добавлен!</b>\n\n"
                     "🔥 Теперь он отобразиться в списке ваших каналов на сайте")
